stresstest.yml
config:
  target: 'http://localhost:9008'
  processor: "./artilleryfunc.js"
  phases:
    - duration: 60
      arrivalRate: 300
  defaults:
    headers:
      x-my-service-auth: '987401838271002188298567'
scenarios:
  - flow:
    - function: "randomizeNum"
    - get:
        url: "/movie/{{randomNum}}"